integrarium/stm32_ventil/main.c
  /* Enable USART1 */
  USART_Cmd(USART2, ENABLE);
}

/*******************************************************************************
* Function Name  : UARTSend
* Description	 : Send a string to the UART.
* Input 	 : - pucBuffer: buffers to be printed.
*		 : - ulCount  : buffer's length
* Output	 : None
* Return	 : None
*******************************************************************************/
void UARTSend(const unsigned char *pucBuffer, unsigned long ulCount)
{
    //
    // Loop while there are more characters to send.
    //
    while(ulCount--)
    {
    USART_SendData(USART2, *pucBuffer++);// Last Version USART_SendData(USART1,(uint16_t) *pucBuffer++);
//	USART_SendData(USART1, *pucBuffer++);// Last Version USART_SendData(USART1,(uint16_t) *pucBuffer++);
	/* Loop until the end of transmission */
    while(USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET)
//	while(USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
	{
	}
    }
}


/*******************************************************************************
* Function Name  : usart_rxtx
* Description	 : Print "Welcome to CooCox!"  on Hyperterminal via USART1.
* Input 	 : None
* Output	 : None
* Return	 : None
*******************************************************************************/
void usart_init(void)
{
//	    const unsigned char menu[] = " Welcome to CooCox!\r\n";

	    /* Enable USART1, USART2 and GPIOA clock */
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

	    /* NVIC Configuration */
//	    NVIC_Configuration();


	    /* Configure the GPIOs */
	    GPIO_Configuration();

	    /* Configure the USART2 */
	    USART_Configuration(ModBusUartSpeed); //из main.h

	    /* Enable the USART2 Receive interrupt: this interrupt is generated when the
		 USART2 receive data register is not empty */
	    USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);	//Прерывание по приему
	    USART_ITConfig(USART2, USART_IT_TC, ENABLE);	//Прерывание по завершению отправки

	    NVIC_EnableIRQ(USART2_IRQn); //Включаем прерывания от UART
	    NVIC_SetPriority(USART2_IRQn, 0); //Прерывание от UART, приоритет 0, самый высокий
//	    USART2->CR1 |= USART_CR1_RXNEIE;
//	    USART2->CR1 |= USART_CR1_; //Прерывание по завершению отправки
	    USART_ClearFlag (USART2, USART_FLAG_TC);


	    /* print welcome information */
//	    UARTSend(menu, sizeof(menu));
}

/**
  * @brief  Initializes the SPI Interface used to drive the LCD and uSD card
  *	    available on adafruit 1.8" TFT shield.
  * @note   This function must by called by the application code before to initialize
  *	    the LCD and uSD card.
  * @param  None
  * @retval None
  */

//----------- RTC -------------------------------
unsigned char RTC_Init(void)
{
	// Включить тактирование модулей управления питанием и управлением резервной областью
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
	// Разрешить доступ к области резервных данных
	PWR_BackupAccessCmd(ENABLE);
	// Если RTC выключен - инициализировать
/*
	if ((RCC->BDCR & RCC_BDCR_RTCEN) != RCC_BDCR_RTCEN)
	{
		// Сброс данных в резервной области
//		  RCC_BackupResetCmd(ENABLE);
//		  RCC_BackupResetCmd(DISABLE);

		// Установить источник тактирования кварц 32768
//		  RCC_LSEConfig(RCC_LSE_ON);
//		  while ((RCC->BDCR & RCC_BDCR_LSERDY) != RCC_BDCR_LSERDY) {}
		RCC_RTCCLKConfig(RCC_RTCCLKSource_HSE_Div128);

		RTC_SetPrescaler(125000-1); // Устанавливаем делитель, чтобы часы считали секунды

		// Включаем RTC
		RCC_RTCCLKCmd(ENABLE);

		// Ждем синхронизацию
		RTC_WaitForSynchro();

		return 1;
	}
*/
	return 0;
}
//----------------------------------------------------------------------------------
void Timer2_Config(int MCU_Frequency)
  {

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
	  TIM_TimeBaseInitTypeDef timer_base;
	  TIM_TimeBaseStructInit(&timer_base);
	  timer_base.TIM_Prescaler = 115200/ModBusUartSpeed; //(MCU_Frequency/1000000) - 1;
	  TIM_TimeBaseInit (TIM2, &timer_base);
	  TIM_ITConfig (TIM2, TIM_IT_Update, ENABLE);

	  NVIC_EnableIRQ(TIM2_IRQn); //Разрешение прерывания

  }
//----------------------------------------------------------------------------------
void Timer1_Config(int MCU_Frequency)
  {

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1,ENABLE);
	  TIM_TimeBaseInitTypeDef timer_base;
	  TIM_TimeBaseStructInit(&timer_base);
	  timer_base.TIM_Prescaler = 1;
	  timer_base.TIM_Period = 2;

	  TIM_TimeBaseInit (TIM1, &timer_base);

	  TIM_OCInitTypeDef outputChannelInit;

	  TIM_OCStructInit(&outputChannelInit);
	  outputChannelInit.TIM_Pulse = 1;			      //
	  outputChannelInit.TIM_OCMode = TIM_OCMode_PWM1;
	  outputChannelInit.TIM_OutputState = TIM_OutputState_Disable;
	  outputChannelInit.TIM_OutputNState = TIM_OutputNState_Enable;
	  outputChannelInit.TIM_OCPolarity = TIM_OCPolarity_High;
	  TIM_OC1Init(TIM1, &outputChannelInit);

	  TIM_Cmd(TIM1, ENABLE);

  }
//----------------------------------------------------------------------------------
void Timer3_Config(int MCU_Frequency)
  {

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	  TIM_TimeBaseInitTypeDef timer_base;
	  TIM_TimeBaseStructInit(&timer_base);
	  timer_base.TIM_Prescaler = 0;
	  TIM_TimeBaseInit (TIM3, &timer_base);

	  TIM_OCInitTypeDef outputChannelInit;

	  TIM_OCStructInit(&outputChannelInit);
	  outputChannelInit.TIM_Pulse = 2;			      //
	  outputChannelInit.TIM_OCMode = TIM_OCMode_PWM1;
	  outputChannelInit.TIM_OutputState = TIM_OutputState_Enable;
	  outputChannelInit.TIM_OutputNState = TIM_OutputNState_Disable;
	  outputChannelInit.TIM_OCPolarity = TIM_OCPolarity_High;
	  TIM_OC3Init(TIM3, &outputChannelInit);

	  outputChannelInit.TIM_Pulse = 2;			      //
	  outputChannelInit.TIM_OCMode = TIM_OCMode_PWM1;
	  outputChannelInit.TIM_OutputState = TIM_OutputState_Enable;
	  outputChannelInit.TIM_OutputNState = TIM_OutputNState_Disable;
	  outputChannelInit.TIM_OCPolarity = TIM_OCPolarity_High;
	  TIM_OC4Init(TIM3, &outputChannelInit);

	  TIM_ICInitTypeDef inputChannelInit;

	  TIM_ICStructInit(&inputChannelInit);
	  inputChannelInit.TIM_Channel = TIM_Channel_1; 			   //
	  inputChannelInit.TIM_ICPolarity = TIM_ICPolarity_Rising;
	  inputChannelInit.TIM_ICSelection = TIM_ICSelection_DirectTI;
	  inputChannelInit.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	  inputChannelInit.TIM_ICFilter = 0;
	  TIM_ICInit(TIM3, &inputChannelInit);

	  inputChannelInit.TIM_Channel = TIM_Channel_2; 			   //
	  inputChannelInit.TIM_ICPolarity = TIM_ICPolarity_Rising;
	  inputChannelInit.TIM_ICSelection = TIM_ICSelection_DirectTI;
	  inputChannelInit.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	  inputChannelInit.TIM_ICFilter = 0;
	  TIM_ICInit(TIM3, &inputChannelInit);

