integrarium/stm32_ventil/main.c
//    GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_I2C1);
//    GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_I2C1);
    // включаем I2C1
    I2C_Cmd(I2C1, ENABLE);
}
//*******************************************************************************************************
void I2C_StartTransmission(I2C_TypeDef* I2Cx, uint8_t transmissionDirection,  uint8_t slaveAddress)
{
    // На всякий слуыай ждем, пока шина осовободится
	SetTimingDelay(10);
	while(I2C_GetFlagStatus(I2Cx, I2C_FLAG_BUSY))	  if (GetTimingDelay()==0) { i2c_error=1;break;  }
    if	(I2C_GetFlagStatus(I2Cx, I2C_FLAG_BUSY))
	{
//	while(1); //пипец

	}

    // Генерируем старт
    I2C_GenerateSTART(I2Cx, ENABLE);
    // Ждем пока взлетит нужный флаг
	SetTimingDelay(10);
    while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_MODE_SELECT))
		  if (GetTimingDelay()==0) {i2c_error=2;break;}
    // Посылаем адрес подчиненному
    I2C_Send7bitAddress(I2Cx, slaveAddress, transmissionDirection);
    // А теперь у нас два варианта развития событий - в зависимости от выбранного направления обмена данными
	SetTimingDelay(10);
    if(transmissionDirection== I2C_Direction_Transmitter)
    {
	while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
				if (GetTimingDelay()==0) {i2c_error=3;break;}
    }
    if(transmissionDirection== I2C_Direction_Receiver)
    {
      while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
			if (GetTimingDelay()==0) {i2c_error=4;break;}

    }
}

/***************************************************************************************/
void I2C_WriteData(I2C_TypeDef* I2Cx, uint8_t data)
{
    I2C_SendData(I2Cx, data);
	SetTimingDelay(10);
    while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTED))
	     if (GetTimingDelay()==0) {i2c_error=5;break;}
}
/***************************************************************************************/
uint8_t I2C_ReadData(I2C_TypeDef* I2Cx)
{
    uint8_t data;

//ждём
	SetTimingDelay(10);
     while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_RECEIVED))
	   if (GetTimingDelay()==0) {i2c_error=6;break;}

//опять ждём
	SetTimingDelay(10);
	while(!(I2Cx->SR1 & I2C_SR1_RXNE)) if (GetTimingDelay()==0) {i2c_error=7;break;}

//читаем
	data = I2Cx->DR;

	return data;
}

/***************************************************************************************/
void XGZP_WriteByte(I2C_TypeDef* I2Cx, uint8_t addr, uint8_t data)
  {
    if (i2c_error>0) return;
	I2C_StartTransmission(I2Cx,I2C_Direction_Transmitter,0xDA);
    I2C_WriteData(I2Cx,addr);
    I2C_WriteData(I2Cx,data);
    I2C_GenerateSTOP(I2Cx, ENABLE);
  }
/***************************************************************************************/
uint8_t XGZP_ReadByte(I2C_TypeDef* I2Cx, uint8_t addr)
  {
    if (i2c_error>0) return 0;
    uint8_t tmp;
	I2C_StartTransmission(I2Cx,I2C_Direction_Transmitter,0xDA);
    I2C_WriteData(I2Cx,addr);
    I2C_GenerateSTOP(I2Cx, ENABLE);
    I2C_StartTransmission(I2Cx,I2C_Direction_Receiver,0xDA);
    I2C_AcknowledgeConfig(I2Cx,DISABLE);
    tmp=I2C_ReadData(I2Cx);
    I2C_GenerateSTOP(I2Cx, ENABLE);
    return tmp;
  }
/***************************************************************************************/
void hx711_clkpulse ()
  {
	 GPIOB->ODR|=(GPIO_ODR_ODR15);    //SCK = 1    импульс начало
	 GPIOB->ODR|=(GPIO_ODR_ODR15);    //SCK = 1    импульс начало
	 GPIOB->ODR|=(GPIO_ODR_ODR15);    //SCK = 1    импульс начало
	//Count=Count^0x800000;
	 GPIOB->ODR&=~(GPIO_ODR_ODR15);    //SCK = 0  импульс конец
	 GPIOB->ODR&=~(GPIO_ODR_ODR15);    //SCK = 0  импульс конец
	 GPIOB->ODR&=~(GPIO_ODR_ODR15);    //SCK = 0  импульс конец
  }

//------ FLASH --------------------------------------------------------

uint32_t Read_Flash(uint32_t Data_adr)
{
   return *(uint32_t*) Data_adr;

}

//поиск позиции последнего непустого слова в странице flash
u16 FlashSearch (uint8_t ParNum)
  {
  u16 i;
  u32 PageAddr=FlashLastPageAddr-ParNum*FlashPageSize;
  for (i=FlashPageSize/2-1; i>0; i--)
    {
    if (((uint16_t*)PageAddr)[i] < 0xffff)  break;
    }
  return i;
  }

// чтение параметра по его номеру из флеша
u16 ReadFlashParam(uint8_t ParNum)
  {
	u16 idx;
	idx = FlashSearch(ParNum);
	return ((uint16_t*)(FlashLastPageAddr-ParNum*FlashPageSize))[idx];

//    return *(uint16_t*)(PageAddr+FlashPageSize-2-i);
  }

// запись параметра с заданным номером во флеш
void WriteFlashParam(uint8_t ParNum, u16 ParValue)
  {
	u16 idx;
	idx = FlashSearch(ParNum);
    FLASH_Unlock();
	if ((idx==FlashPageSize/2-1) && (((uint16_t*)(FlashLastPageAddr-ParNum*FlashPageSize))[idx])<0xffff)
	  {
	  FLASH_ErasePage(FlashLastPageAddr-ParNum*FlashPageSize);	  //страница полностью записана - надо стереть
	  }
    if (((uint16_t*)(FlashLastPageAddr-ParNum*FlashPageSize))[idx]==0xffff)
		  FLASH_ProgramHalfWord  ( FlashLastPageAddr-ParNum*FlashPageSize,  ParValue  );   //чистая страница - пишем в начало
    else
	   FLASH_ProgramHalfWord  ( FlashLastPageAddr-ParNum*FlashPageSize+2*idx+2,  ParValue  );  //пишем в свободную ячейку (следующую за занятой)
	FLASH_Lock();
  }

void FlashFill (void)
	{
    u16 i, temp16;
	for (i=0; i<ParNumTableSize; i++)
	  {
	  temp16 = ReadFlashParam(i);
	  if (temp16==0xffff)  //во флеше пусто - запишем туда из озу
		WriteFlashParam(i, dev_conf[0].devConfig[ParNumTable[i]]);     //ram->flash
	  else dev_conf[0].devConfig[ParNumTable[i]]=ReadFlashParam(i); //иначе flash->ram
	  }
	}

void FlashSyncronize (void)
  {
    u16 i, temp16;
	for (i=0; i<ParNumTableSize; i++)
	  {
	  temp16 = ReadFlashParam(i);
	  if (temp16!=dev_conf[0].devConfig[ParNumTable[i]])  //если есть отличие
		  WriteFlashParam(i, dev_conf[0].devConfig[ParNumTable[i]]);	 //ram->flash
	  }
  }

//------------------------------------------------------------------------------------

void BKPWriteAll(void)
  {
    u16 i, temp16;
    u16 buf[10];
    for (i=0; i<ParNumTableBKPSize; i++) //запись всех параметров в BKP
      {
      buf[i] = dev_conf[0].devConfig[ParNumTableBKP[i]];
      BKP_WriteBackupRegister(BKP_DR1+i*4,buf[i]); //ram->bkp
      }
    temp16 = calculateCRC(buf, 18); //новая crc
    BKP_WriteBackupRegister(BKP_DR1+9*4,temp16); //запись CRC

