integrarium/stm32_ventil/main.c
      if (i2c_error==0)
	  {
	 CorrConf[0]->rawpress_i2c = press;
	 CorrConf[0]->temper_i2c = temper*100/256; // Получаем градусы * 100

//	 CorrConf->press_i2c = ((s32)(temp16)*5000/32767-5000-CorrConf->press_offset);
//	  CorrConf[0]->press_i2c = (((temp16+1024)/60)-500-CorrConf[0]->press_offset)*(1+(CorrConf[0]->kf_press/100));
//		  CorrConf[0]->press_i2c = ( (temp16+1024)/60 -500-CorrConf[0]->press_offset)*(100+CorrConf[0]->kf_press)/100;

	      //CorrConf[0]->press_i2c =(press-CorrConf[0]->press_offset)/(1+CorrConf[0]->kf_press);// для уменьшения в К раз - не работает

	 press32=press;
	 press32-=CorrConf[0]->press_offset;
	 if (press32>0x7fff) press32 =0x7fff;
	 if (press32<-0x8000) press32 =-0x8000;
//	CorrConf[0]->tcomp_offset = (2.5*(CorrConf[0]->temper_base/100 - CorrConf[0]->temper_i2c/100)); // уход нуля
//	    CorrConf[0]->tcomp_diap = (press32 + CorrConf[0]->tcomp_offset ) * (100+CorrConf[0]->kf_press)/100 * (1.65 * (CorrConf[0]->temper_i2c - CorrConf[0]->temper_base)/CorrConf[0]->press_diap)/100; //уход диапазона
//	    CorrConf[0]->press_i2c = (press32 + CorrConf[0]->tcomp_offset ) * (100+CorrConf[0]->kf_press)/100 + CorrConf[0]->tcomp_diap; //сумма
	CorrConf[0]->filter = ((CorrConf[0]->filter*19)+   press32)/20; //с фильтрацией
//	  CorrConf[0]->filter = ((CorrConf[0]->press_i2c*19)+  ( press32 + CorrConf[0]->tcomp_offset ) * (100+CorrConf[0]->kf_press)/100 + CorrConf[0]->tcomp_diap)/20; //с фильтрацией
	//CorrConf[0]->press_i2c =   (( press32 + CorrConf[0]->tcomp_offset ) * (100+CorrConf[0]->kf_press)/100 + CorrConf[0]->tcomp_diap); //с фильтрацией
	    //CorrConf[0]->press_i2c = (press - CorrConf[0]->press_offset + CorrConf[0]->tcomp_offset ) * (100+CorrConf[0]->kf_press)/100; //сумма

	  CorrConf[0]->press_i2c=CorrConf[0]->filter*10/16;

	  if (CorrConf[0]->press_i2c > 0) VentConf->cur_flaw=sqrt(abs(CorrConf[0]->press_i2c))*VentConf->Kfactor/3.16;
	  else VentConf->cur_flaw=-sqrt(abs(CorrConf[0]->press_i2c))*VentConf->Kfactor/3.16;

	CorrConf[0]->i2c_success_count++;
	  CorrConf[0]->i2c_sens_error = 0; //нет ошибок
	  }

     // 		  (temp16- 1024.0) / 6.0 - 5000;

     else
       {
       CorrConf[0]->i2c_sens_error = i2c_error; //ошибка датчика

       i2c_error=0;
       I2C1->CR1 |= I2C_CR1_SWRST; //reset


// конфигурируем ножки на выход (иногда слетала конфигурация)
	    GPIOB->CRH |= GPIO_CRH_CNF8_0 | GPIO_CRH_CNF8_1 |GPIO_CRH_CNF9_0 | GPIO_CRH_CNF9_1;
	    if (!((GPIOB->IDR) & (1<<9))) //слейв держит шину
	      {
	      while  (!((GPIOB->IDR) & (1<<9))) //PB9
		 {
		 GPIOB->CRH &= ~ GPIO_CRH_CNF8_1; //шлём клоки на PB8, пока слейв не отпуситит шину
		 Delay(1);
		 GPIOB->CRH |= GPIO_CRH_CNF8_1;
		 Delay(1);
		 }
	      }


       Delay(10);
       I2C1->CR1 &= ~I2C_CR1_SWRST; //отпускаем reset
       init_I2C(I2C1);	   //инит i2c после ресета

       }

 // -------------------------- второй датчик ------------------------------------------------------------------------------

     //отключаемся от 1го датчика
     GPIOB->ODR |= GPIO_ODR_ODR8 | GPIO_ODR_ODR9;
     GPIOB->CRH &= ~GPIO_CRH_CNF8_0 & ~GPIO_CRH_MODE8_1 & ~GPIO_CRH_MODE8_0 & ~GPIO_CRH_CNF9_0 & ~GPIO_CRH_MODE9_1 & ~GPIO_CRH_MODE9_0;
    //подключаемся к 2му датчику
     GPIO_PinRemapConfig( GPIO_Remap_I2C1 , DISABLE );
     GPIOB->CRL |= GPIO_CRL_CNF6_0 | GPIO_CRL_MODE6_1 | GPIO_CRL_MODE6_0 | GPIO_CRL_CNF7_0 | GPIO_CRL_MODE7_1 | GPIO_CRL_MODE7_0;
     GPIOB->ODR &= ~GPIO_ODR_ODR6 & ~GPIO_ODR_ODR7;

     XGZP_WriteByte(I2C1, 0xa5, XGZP_ReadByte(I2C1, 0xa5)&0xfd); //Set ADC output calibrated Data

     XGZP_WriteByte(I2C1, 0x30, 0x0A); //indicate a combined conversion (once temperature conversion immediately followed by once sensor signal conversion)

     while ((XGZP_ReadByte(I2C1, 0x30) & 0x08) > 0); //Judge whether Data collection is over
     //     press=XGZP_ReadByte(I2C1, 0x5) << 16;
	  press=XGZP_ReadByte(I2C1, 0x6) << 8;
	  press|=XGZP_ReadByte(I2C1, 0x7) ;

// if (press&0x8000) press |=0xffff0000;  //расширение знака

     temper=XGZP_ReadByte(I2C1, 0x9) << 8;
     temper|=XGZP_ReadByte(I2C1, 0xa);

    Delay(1);

  if (i2c_error==0)
	  {
	 CorrConf[1]->rawpress_i2c = press;
	 CorrConf[1]->temper_i2c = temper*100/256;
//	 CorrConf->press_i2c = ((s32)(temp16)*5000/32767-5000-CorrConf->press_offset);
//	  CorrConf[1]->press_i2c = (((temp16+1024)/60)-500-CorrConf[1]->press_offset)*(1+(CorrConf[1]->kf_press/100));
//	  CorrConf[1]->press_i2c = ( (temp16+1024)/60 -500-CorrConf[1]->press_offset)*(100+CorrConf[1]->kf_press)/100;
	     // CorrConf[1]->press_i2c = (press-CorrConf[1]->press_offset)*(100+CorrConf[1]->kf_press)/100; // для увеличения на К процентов
	   // для увеличения на К процентов
	 press32=press;
	 press32-=CorrConf[1]->press_offset;
	 if (press32>0x7fff) press32 =0x7fff;
	 if (press32<-0x8000) press32 =-0x8000;
//	  CorrConf[1]->tcomp_offset = (2.5*(CorrConf[0]->temper_base/100 - CorrConf[1]->temper_i2c/100));
//	  CorrConf[1]->tcomp_diap = ( press32 + CorrConf[1]->tcomp_offset ) * (100+CorrConf[1]->kf_press)/100 * (1.65 * (CorrConf[1]->temper_i2c - CorrConf[0]->temper_base)/CorrConf[1]->press_diap)/100;
		  CorrConf[1]->filter = ((CorrConf[1]->filter*19)+  press32)/20;
//		  CorrConf[1]->filter = ((CorrConf[1]->filter*19)+  ( press32 + CorrConf[1]->tcomp_offset ) * (100+CorrConf[1]->kf_press)/100 + CorrConf[1]->tcomp_diap)/20;
	 //	  CorrConf[1]->filter =   (( press32 + CorrConf[1]->tcomp_offset ) * (100+CorrConf[1]->kf_press)/100 + CorrConf[1]->tcomp_diap);


	  CorrConf[1]->press_i2c=CorrConf[1]->filter*10/16;
//	 dev_conf[1].devConfig[0x11]=CorrConf[1]->press_i2c;
//	  CorrConf[1]->press_i2c/=2;
//	dev_conf[1].devConfig[0x11]>>=4;
 //	CorrConf[1]->press_i2c=dev_conf[1].devConfig[0x11];
	//CorrConf[1]->press_i2c = ( press - CorrConf[1]->press_offset + CorrConf[1]->tcomp_offset ) * (100+CorrConf[1]->kf_press)/100;
    if (VentConf->set_select == 0) //первая уставка
	  if (VentConf->fan_on != 0) //вентилятор включен
    	  if (abs(VentConf->cur_flaw - CorrConf[0]->ustav)<(CorrConf[0]->ustav / 5)) //если текущий поток в пределах -20% +20% от уставки - можно выдавать аварию фильтра
	  if (CorrConf[1]->press_i2c/10 > VentConf->max_pres) VentConf->filter_alarm = 1;
	      else if (CorrConf[1]->press_i2c/10 < VentConf->min_pres) VentConf->filter_alarm = 2;
		   else VentConf->filter_alarm = 0;
	else VentConf->filter_alarm = 0;  //поток меньше 80% или больше 120% от заданного - нет аварии фильтра
      else VentConf->filter_alarm = 0;	//вентилятор выключен - нет аварии фильтра
    else VentConf->filter_alarm = 0;	//вторая уставка - нет аварии фильтра


	  CorrConf[1]->i2c_success_count++;
       CorrConf[1]->i2c_sens_error = 0; //нет ошибок
	  }

  //			  (temp16- 1024.0) / 6.0 - 5000;

  else
    {
    CorrConf[1]->i2c_sens_error = i2c_error; //ошибка датчика

    i2c_error=0;
    I2C1->CR1 |= I2C_CR1_SWRST; //reset

// конфигурируем ножки на выход (иногда слетала конфигурация)

	    GPIOB->CRL |= GPIO_CRL_CNF6_0 | GPIO_CRL_CNF6_1 |GPIO_CRL_CNF7_0 | GPIO_CRL_CNF7_1;

