integrarium/stm32_ventil/main.c
	    if (!((GPIOB->IDR) & (1<<7))) //слейв держит шину
	      {
	      while  (!((GPIOB->IDR) & (1<<7)))
		 {
		 GPIOB->CRL &= ~ GPIO_CRL_CNF6_1; //шлём клоки, пока слейв не отпуситит шину
		 Delay(1);
		 GPIOB->CRL |= GPIO_CRL_CNF6_1;
		 Delay(1);
		 }
	      }

    Delay(10);
    I2C1->CR1 &= ~I2C_CR1_SWRST; //отпускаем reset
    init_I2C(I2C1);	//инит i2c после ресета

    }




 //отключаемся от 2го датчика
 GPIOB->ODR |= GPIO_ODR_ODR6 | GPIO_ODR_ODR7;
 GPIOB->CRL &= ~GPIO_CRL_CNF6_0 & ~GPIO_CRL_MODE6_1 & ~GPIO_CRL_MODE6_0 & ~GPIO_CRL_CNF7_0 & ~GPIO_CRL_MODE7_1 & ~GPIO_CRL_MODE7_0;
 //подключаемся к 1му датчику
 GPIO_PinRemapConfig( GPIO_Remap_I2C1 , ENABLE );
 GPIOB->CRH |= GPIO_CRH_CNF8_0 | GPIO_CRH_MODE8_1 | GPIO_CRH_MODE8_0 | GPIO_CRH_CNF9_0 | GPIO_CRH_MODE9_1 | GPIO_CRH_MODE9_0;
 GPIOB->ODR &= ~GPIO_ODR_ODR8 & ~GPIO_ODR_ODR9;

 // чтение PCA9534
 CorrConf[0]->PCA9534_0 = ~SW_I2C_ReadControl_8Bit(SW_I2C2,0x40,0);
// CorrConf[0]->PCA9534_2 = SW_I2C_ReadControl_8Bit(SW_I2C2,0x40,2);

 // запись в PCA9534 новых значений
 SW_I2C_WriteControl_8Bit(SW_I2C2,0x40,3,~(CorrConf[0]->PCA9534_3));
 SW_I2C_WriteControl_8Bit(SW_I2C2,0x40,1,(CorrConf[0]->PCA9534_1));


// I2C_StartTransmission(I2C2,I2C_Direction_Transmitter,0x40);
// I2C_WriteData(I2C2,1);
// I2C_WriteData(I2C2,Count_time);
// I2C_GenerateSTOP(I2C2, ENABLE);
 Count_time++;


 // читаем с hx710 температуру и давление

 GPIOB->ODR&=~(GPIO_ODR_ODR15);    //SCK = 0
 Count=0;
 if (!(GPIOB->IDR&(GPIO_IDR_IDR14)))
   {
 for (i=0;i<24;i++)
         {
	 hx711_clkpulse (); //импульс на clk
         Count<<=1;
         if(GPIOB->IDR&(GPIO_IDR_IDR14)) Count++;
         }
 hx711_clkpulse (); //25й импульс
 hx711_clkpulse (); //26й импульс
if (hx710_phase==0) //была фаза давления
 {
	hx710_phase=1; //переключаемся на температуру
 VentConf->HX711_press=Count>>8;

 }
 else
     {
	 VentConf->HX711_temper=(Count-2560000)>>7;
	 hx710_phase=0; //переключаемся на давление
	 hx711_clkpulse (); //27й импульс
     }
   }


// **************** логика режима "шлюз" ************************
u16 LightOnMoment, FanOnMoment, CheckOnMoment;

if (CorrConf[0]->WorkMode & 1) //режим "шлюз"
 {
 VentConf->fan_on=0; //выкл регулятора

 switch (GateWayState)
  {
  case 0: //ждём открытия любой двери
   	  TIM3->CCR3=0;       //выкл вентилятора
	  CorrConf[0]->power=0;
	  VentConf->fan_power=0;
   	  VentConf->UV_on=0; //выкл УФ

	  CorrConf[0]->PCA9534_1 &= ~0xf0; //разблокировка дверей,  выкл светофор, выкл пищалки

	 if (SecondCounter-LightOnMoment>CorrConf[0]->LightTime)	  VentConf->LightOn=0; //выкл свет

	  if (CorrConf[0]->PCA9534_0 & 1) //открыта дверь 1 (грязная)
	    {
		GateWayState=1;
		CorrConf[0]->PCA9534_1 |= 0x70; //блокировка противоположной двери и вкл светофор, пищалка
		VentConf->LightOn=1; //вкл свет
	    };

	  if (CorrConf[0]->PCA9534_0 & 2) //открыта дверь 2 (чистая)
	    {
		GateWayState=2;
		CorrConf[0]->PCA9534_1 |= 0xb0; //блокировка противоположной двери, вкл светофор, пищалка
		VentConf->LightOn=1; //вкл свет
	    };
	  break;
  case 1: //ждём закрытия двери 1
	  if ((CorrConf[0]->PCA9534_0 & 3)==0) //обе двери закрыты
	    {
		  CorrConf[0]->PCA9534_1 &= ~0x10; // выкл пищалки
		  TIM3->CCR3=0xffff;       //вкл вентилятора на максимум
		  CorrConf[0]->power=0xffff;
	          VentConf->fan_power=10000;
		  FanOnMoment=SecondCounter; //взводим таймер выключения вентилятора
	      VentConf->UV_on=1; //вкл УФ
			GateWayState=3;
		  CheckOnMoment =SecondCounter; // взводим таймер проверки фильтра
	    }
	  break;
  case 2: //ждём закрытия двери 2

	  if ((CorrConf[0]->PCA9534_0 & 3)==0) //обе двери закрыты
	    {
		if (CorrConf[0]->WorkMode & 2)  //двусторонний шлюз
		  {
		  TIM3->CCR3=0xffff;       //вкл вентилятора на максимум
		  CorrConf[0]->power=0xffff;
	          VentConf->fan_power=10000;

		  FanOnMoment=SecondCounter; //взводим таймер выключения вентилятора
		  VentConf->UV_on=1; //вкл УФ
			GateWayState=3;
		  CheckOnMoment =SecondCounter; // взводим таймер проверки фильтра
	      }
		else
		  {
			GateWayState=4;
		  }
	    }
	  break;
  case 3:  //ждём окончания цикла обработки
		CorrConf[0]->PCA9534_1 |= 0xc0; //блокировка двух дверей
		if (SecondCounter-CheckOnMoment > CorrConf[0]->CheckTime)
		       {
			// Проверка давления на фильтре
			   if (VentConf->min_pres > CorrConf[0]->press_i2c )
			      {
				    VentConf->filter_alarm = 2;
				    GateWayState=4; // переходим в начальное состояние
				    break;
			      }
			   else {
				  VentConf->filter_alarm = 0;
			      }
		       }
	  //мигаем светофором
	  if (mSecondCounter>500) CorrConf[0]->PCA9534_1 &= ~0x20; //выкл светофор
	  else  CorrConf[0]->PCA9534_1 |= 0x20; //вкл светофор

	  if (SecondCounter-FanOnMoment > CorrConf[0]->BlowTime)
         {
		GateWayState=4;
	  }
		  
	  break;

  default:
	  LightOnMoment = SecondCounter; //взводим световой таймер
		GateWayState=0;
	  break;
  }
 }



//меняем состояние светодиода
 GPIO_WriteBit(GPIOC, GPIO_Pin_15, !GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_15));

	  }

}

